import React, { useState } from "react";
import style from "./Rules.module.scss";
import RightMenu from "Components/RightMenu/RightMenu";
import Footer from "Components/Footer/Footer";
import Header from "Components/Header/Header";

const Rules = ({ user, userIsLoaded }) => {
  const [currentRulesCategory, setCurrentRulesCategory] = useState(0);

  const rulesList = [
    [
      {
        id: 1,
        text: "Регистрируя аккаунт на нашем проекте, пользователь подтверждает свою ознакомленность и согласие с нижеизложенными положениями и правилами игры, пользователь подтверждает согласие на сбор и обработку неперсонализированных технических данных, а также данных, присущих особенностям функционирования в сети Интернет.",
      },
      {
        id: 2,
        text: "Пользователь подтверждает, что незнание им (пользователем) правил не освобождает его (пользователя) от ответственности.",
      },
      {
        id: 3,
        text: "Администрация проекта оставляет за собой право изменять любые пункты правил без оповещения и предупреждения пользователей. Изменения в правилах отслеживается пользователями самостоятельно на текущей странице сайта.",
      },
      {
        id: 4,
        text: "Цель данных правил – защита интересов пользователей и установление порядка на всех ресурсах проекта.",
      },
      {
        id: 5,
        text: "Пользование сервисами осуществляется пользователем через клиентскую обязательную часть – Лаунчер, а так же по средствам дополнительно устанавливаемых (в зависимости от выбранного пользователем игрового режима и желаемых дополнительных функций) частей программного продукта – модов и сайта проекта.",
      },
      {
        id: 6,
        text: "Толкование правил сайта осуществляется только главными Администраторами. Любые другие попытки истолковать правила в пользу любой из сторон признаются некорректными.",
      },
      {
        id: 7,
        text: "Администрация ведет управление игровыми процессами и всем проектом -исключительно по своему усмотрению.",
      },
      {
        id: 8,
        text: "Право использования всех сервисов проекта, предоставляется Администрацией на бесплатной основе, за исключением функций, возможность приобретения которых является дополнительной и необязательной, не дающих никаких возможностей, без которых невозможен полноценный игровой процесс. Использование функционала предоставляется в текущей форме, не гарантируя 100% правильность работы. Игровые вещи, способности и т.п, утерянные в связи с ненадлежащей работой неоплачиваемых сервисов, не возвращаются.",
      },
      {
        id: 9,
        text: "Так как не всегда удается определить нарушение правил пользователем, окончательное решение остается за Администраторами проекта.",
      },
      {
        id: 10,
        text: "Администраторы проекта оставляют за собой право закрыть пользователю возможность использования программного продукта по причине, не указанной в настоящих правилах. Причины банов всегда можно узнать в списке заблокированных игроков.",
      },
      {
        id: 11,
        text: "Периодические обновления (очистки) игрового мира – Вайп, производятся Администрацией по истечении временного отрезка, далее которого нормальное функционирование сервисов невозможно, ввиду особенностей построения игрового процесса. Длительность вышеуказанного временного отрезка определяется администрацией самостоятельно, исходя из технической возможности. Вайп не является отказом пользователю в использовании платных дополнений, так как при этом не происходит отзыв лицензии на часть программного продукта или ограничения функционала этой части. При этом возможен возврат ранее приобретенных игровых предметов за срок 7 дней.",
      },
      {
        id: 12,
        text: "Оплата дополнительных, необязательных, игровых возможностей производится только на сайте проекта. Зачисление средств производится с помощью агрегатора платежей в любой валюте по месту нахождения пользователя, конвертируемой самим агрегатором в рубли. Указанные на страницах сайта сформированные формы, с обозначенными суммами платежей, являются рекомендацией и не носят обязательный характер, равно как и не являются побуждением к действиям.",
      },
      {
        id: 13,
        text: "Пользователь несет ответственность за безопасность своего аккаунта и обязуется соблюдать все надлежащие меры по обеспечению его безопасности. Независимо от того, кем были совершены действия на аккаунте, ответственность всегда несет его владелец. Администрация проекта оставляет за собой право отказать в восстановлении доступа к аккаунту в случае взлома.",
      },
      {
        id: 14,
        text: "Конвертация в монетки проводится на Ваш страх и риск. Администрация не возвращает монетки в случае потери из-за непредвиденных обстоятельств: в ходе обмана, гриферства, отката, бага, дюпа, очисток, читерства, взлома и обмена без модератора.",
      },
      {
        id: 15,
        text: "Возврат привилегий может быть осуществлен при условии, что игровые пакеты ресурсов не были использованы, а с момента приобретения прошло не более трех дней.",
      },
      {
        id: 16,
        text: "Администрация и модерация проекта не несут ответственности и ни при каких условиях не обязаны возвращать игрокам ресурсы или игровую валюту, утраченные из-за непредвиденных обстоятельств: в ходе обмана, гриферства, отката, бага, дюпа, очисток, читерства, взлома и обмена без модератора.",
      },
      {
        id: 17,
        text: "Администратор вправе изъять у пользователя любое имущество, если пользователь не сможет доказать его честное (без использования запрещенных дополнительных программных средств – читов и т.д.) происхождение.",
      },
      {
        id: 18,
        text: "Правообладателями дополнительных частей продукта являются их авторы. Использование этих частей Администрацией осуществляется на основе соглашения о свободном распространении и использовании.",
      },
      {
        id: 19,
        text: "Модератор даёт оценку действий игрока, анализируя их соответствие правилам проекта, и выносит решение, руководствуясь собственными знаниями, опытом и соотнося принимаемое решение с личностью игрока.",
      },
    ],

    [
      {
        id: 1,
        section: "1. Правила игры",
        rules: [
          "1.1 Игрокам запрещено приватить чужое имущество на себя.",
          "1.2 Игрокам запрещено открывать чужие сундуки без согласия владельца.",
          "1.3 Запрещается намеренное убийство игрока в привате с выключенным pvp любым способом.",
          "1.4 Игрокам запрещено создавать регионы привата с названиями, нарушающими правила проекта.",
          "1.5 Запрещено гриферство (нарушением не являются случаи: дом/постройку ограбил один из участников региона; дом/постройку ограбили вне какого-либо привата).",
          "1.6 Запрещено проводить раздачи игровых вещей в любом виде (запрет не распространяется на сервера, имеющие в названии слово 'Dupe').",
          "1.7 Запрещено возводить постройки на расстоянии менее 3 блоков от приватов других игроков.",
          "1.8 Игрокам запрещено создавать варпы и кланы с названием, нарушающим правила проекта.",
        ],
        punishment: "Наказание: Бан от суток до вечного бана.",
      },
      {
        id: 2,
        section: "2. Запрещено использовать читы и баги",
        rules: [
          "2.1 Игрокам запрещено использовать любого рода модификации, дающие преимущества над другими игроками (читы).",
          "2.2 Запрещено использовать баги игрового клиента и сервера, дающие Вам преимущества, а также хранить предметы, полученные с помощью бага.",
          "2.3 Запрещено нарушать стабильность работы игрового сервера.",
        ],
        punishment: "Наказание: Бан от трех суток до вечного бана.",
      },
      {
        id: 3,
        section: "3. Правила общения",
        rules: [
          "3.1 Игрокам запрещено оскорблять кого-либо. Запрещены любые оскорбления или упоминания родственников игроков проекта в оскорбительной форме.",
          "3.2 Запрещено материться, использовать завуалированный мат, а также мат, скрытый символами. Запрещены непристойные выражения, темы сексуального характера, гендерные обсуждения, а также иные вульгарные, мерзкие и похабные выражения.",
          "3.3 Запрещено всячески отвлекать администрацию. Например, просить выдать что-либо или сменить время суток.",
          "3.4 Запрещено засорять чат не информативными и/или повторяющимися фразами.",
          "3.5 Запрещено рекламировать и упоминать любые сторонние ресурсы без согласования с администрацией.",
          "3.6 Запрещен расизм, нацизм, религиозные обсуждения (оскорбления), разжигание межнациональной розни. Запрещено распространение информации, которая связана с организациями или политическими деятелями признанными террористическими или незаконными.",
          "3.7 Запрещено писать сообщения в верхнем регистре(Caps Lock).",
          "3.8 Запрещено совершать обман при обмене/торговле.",
          "3.9 Запрещается оскорблять модераторов/администрацию и игровой проект в целом.",
          "3.10 Запрещается подстрекательство/призывы к нарушению правил сервера.",
          "3.11 Запрещается упоминание наркотических веществ, суицида.",
        ],
        punishment:
          "Наказание: Лишение права общаться в чате, бан от 1 суток до 2 недель, вечный бан.",
      },
      {
        id: 4,
        section: "4. Правила аккаунта",
        rules: [
          "4.1 Запрещено входить, а так же пытаться войти под чужими аккаунтами.",
          "4.2 Запрещено регистрировать несколько аккаунтов.",
          "4.3 Запрещено регистрировать ники, схожие с никами администрации сервера.",
          "4.4 Запрещено представляться администрацией.",
          "4.5 Запрещено регистрировать ник, схожий с ником другого игрока, с целью выдать себя за этого игрока.",
          "4.6 Запрещено выставлять префиксы нарушающие пункты правил.",
          "4.7 Запрещено распространять ссылки с целью получения данных других игроков.",
          "4.8 Запрещено регистрировать ники, нарушающие правила проекта.",
          "4.9 Запрещено выдавать себя за Администрацию и модерацию сервера, делать подражающие ники и префиксы.",
        ],
        punishment: "Наказание: Вечный бан.",
      },
      {
        id: 5,
        section: "5. Правила строительства",
        rules: [
          "5.1 Запрещено строить постройки в виде половых органов или свастики.",
          "5.2 Запрещено строить примитивные сооружения, например, огромные каменные/земляные коробки, высокие узкие башни, высокие столбы воды/лавы, огромные бесполезные надписи, длинные дороги в воздухе, глубокие ямы в земле.",
          "5.3 Запрещено срубать дерево не полностью (оставлять кроны деревьев - в надежде, что осыплется автоматически).",
          "5.4 Запрещено строить высокие 'башенки' и 'пирамидки' из грибов и деревьев.",
          "5.5 Игрок обязан следить за состоянием своих построек и прилегающих к ним территорий.",
        ],
        punishment:
          "Наказание: бан от 1 суток до 2 недель, штраф в игровой валюте, снос постройки, вечный бан.",
      },
      {
        id: 6,
        section: "6. Другие правила",
        rules: [
          "6.1 Запрещено нарушать правила ивент- развлечений.",
          "6.2 Запрещено давать показания на других игроков без предъявления доказательств.",
          "6.3 Запрещено ставить точку /home либо /warp, если на ней находятся ловушки, способные убить игрока, а также если рядом с этой точкой находится чужой регион.",
          "6.4 Запрещено продавать/передавать игровой аккаунт за ресурсы или реальные ценности.",
          "6.5 Запрещено устанавливать скины и плащи, нарушающие правила проекта.",
          "6.6 Запрещено вводить в заблуждение игроков, модерацию и администрацию по техническим и игровым аспектам.",
          "6.7 Запрещено покупать/продавать/передавать игровые ресурсы за реальные ценности.",
        ],
        punishment: "Наказание: бан от 1 суток до 2 недель, вечный бан.",
      },
      {
        id: 7,
        section: "7. Правила донат-возможностей",
        rules: [
          "7.1 Запрещается выдавать предметы , договариваться с игроками, оказывать услуги, полученными с помощью донат прав.",
          "7.2 Запрещается злоупотребление донат правами.",
          "7.3 Запрещается использование возможностей для получения персональной выгоды, не предусмотренными донат возможностями.",
          "7.4 Запрещается использовать донат возможности во вред игрокам, серверу, ландшафту.",
        ],
        punishment:
          "Наказание: Бан от 1 суток до 2 недель, изъятие донат-статуса.",
      },
    ],

    [
      {
        id: 8.1,
        text: "Модераторами считаются люди, имеющие звание Стажёр (Помощник) и выше.",
      },
      {
        id: 8.2,
        text: "Модератор сервера обязан быть грамотным, воспитанным, понимающим, толерантным по отношению ко всем игрокам проекта.",
      },
      {
        id: 8.3,
        text: "Модератор обязан соблюдать цензуру и речевые нормы при общении с игроками.",
      },
      {
        id: 8.4,
        text: "Модератор обязан всегда делать скриншоты нарушения игрока, но не обязан предоставлять их игрокам.",
      },
      {
        id: 8.5,
        text: "Модератор обязан уметь давать отчет своим действиям любому из членов администрации.",
      },
      {
        id: 8.6,
        text: "Основная обязанность модератора - контролировать игровой процесс и вовремя предотвращать различные инциденты, которые могут повлечь за собой нарушение всего свода правил сервера.",
      },
      {
        id: 8.7,
        text: "Модератор обязан указывать сноску на соответствующий пункт данных правил при их исполнении.",
      },
      {
        id: 8.8,
        text: "Модератор обязан исполнять указания (связанные с проектом) администрации вовремя.",
      },
      {
        id: 8.9,
        text: "Модератору запрещено наносить ущерб/урон игроку, если этого не требует ситуация.",
      },
      {
        id: 8.1,
        text: "Модератор не имеет права блокировать/мешать/телепортировать/кикать игроков (в том числе модераторов) без серьезной причины.",
      },
      {
        id: 8.11,
        text: "Модератору запрещено модерировать на серверах, к которым они (модераторы) не 'привязаны'. Исключение - посещение сервера к которому он не привязан возможно только с разрешения Главного Модератора или Администратора.",
      },
      {
        id: 8.12,
        text: "Модератору запрещено модерировать/администрировать/играть на других игровых проектах.",
      },
      {
        id: 8.13,
        text: "Модератор не имеет права злоупотреблять своими правами в пользу себя, друзей или третьих лиц.",
      },
      {
        id: 8.14,
        text: "Модератор не имеет права устраивать обмен или торговлю, снабжать игроков (включая родственников) ресурсами, если эти ресурсы были изъяты у другого игрока или же были добыты с помощью возможностей, доступных только модератору.",
      },
      {
        id: 8.15,
        text: "Модератор может взять отгул, только после повышения и не больше, чем на 14 дней в течение двух месяцев. Стажеры не могут брать отгулы, так как проходят процесс обучения. Стажеры, если захотят взять отгул, будут временно сняты с должности (так что нет смысла подавать заявку, если Вам необходимо куда-либо отлучится через несколько дней).",
      },
      {
        id: 8.16,
        text: "При снятии с поста, аккаунт модератора перманентно блокируется, для отключения чатов и регенерации территорий. На возврат аккаунта могут рассчитывать только модераторы снятые по собственному желанию.",
      },
      {
        id: 8.17,
        text: "При нарушении правил аккаунт модератора временно блокируется до разбирательств.",
      },
      {
        id: 8.18,
        text: "Модератор может быть снят с должности, если будет вносить раздор в коллектив и вести себя неадекватно по отношению к игрокам и коллегам даже вне проекта.",
      },
      {
        id: 8.19,
        text: "Модератору запрещено разглашать посторонним лицам содержание конференции Администрации/Модерации и т.д., личных переговоров с членами Администрации/Модерации и т.д. Для разглашения сообщений из личной беседы необходимо получить разрешение у собеседника. Исключение составляют ситуации, когда текст может служить свидетельством нарушения настоящих правил. Посторонними лицами признаются все, кто не участвует в конференции или личной беседе.",
      },
      {
        id: 8.2,
        text: "Модераторам проекта запрещается выгораживать проступки любых игроков и модераторов.",
      },
      {
        id: 8.21,
        text: "Модераторам проекта запрещено изменять стандартный префикс, который соответствует занимаемой ими должности.",
      },
      {
        id: 8.22,
        text: "Модератор может быть снят с должности, если он хранит у себя ресурсы, которые были получены с помощью бага или дюпа.",
      },
      {
        id: 8.23,
        text: "Модератор может быть снят с должности, если он отсутствовал не по уважительной причине более 5 дней или за продолжительный низкий онлайн.",
      },
      {
        id: 8.24,
        text: "За нарушение любого правила из данного свода, модератор как минимум получит выговор, а как максимум будет снят.",
      },
    ],

    [
      {
        id: 1,
        text: "Запрещается нецензурная брань в любой форме, оскорбительное поведение/троллинг по отношению к игрокам контента.",
        punishment:
          "Удаление сообщения и повышение уровня предупреждений на 15 баллов.",
      },
      {
        id: 2,
        text: "Запрещается дублировать темы. Неоднократно повторяющиеся посты, сообщения не несущие смысловой информации (Флуд)",
        punishment:
          "Удаление сообщений и повышение уровня предупреждений на 10 баллов.",
      },
      {
        id: 3,
        text: "Запрещается написание сообщений одними заглавными (Caps) или многократно повторяющимися буквами.",
        punishment:
          "Удаление сообщений и повышение уровня предупреждений на 5 баллов.",
      },
      {
        id: 4,
        text: "Запрещено рекламировать свои YouTube каналы, сервера, сайты и прочее.",
        punishment:
          "Удаление рекламы с последующей блокировкой форумного аккаунта.",
      },
      {
        id: 5,
        text: "Запрещено выдавать себя за администрацию и модерацию проекта не являясь таковыми. Пользователям запрещается писать подобные сообщения: 'Не по форме', 'Не в тот раздел>', 'Нет доказательств', 'Закрыто' и прочее.",
        punishment:
          "Удаление сообщений и повышение уровня предупреждений на 30 баллов.",
      },
      {
        id: 6,
        text: "Запрещается создавать темы, которые содержат порнографию/пропаганду наркотиков, разжигание межнациональной розни.",
        punishment:
          "Удаление сообщений и повышение уровня предупреждений на 100 баллов.",
      },
      {
        id: 7,
        text: "Запрещается создавать темы и сообщения, цель которых - пошатнуть авторитет 'LemonCraft'.",
        punishment:
          "Удаление сообщений и повышение уровня предупреждений на 100 баллов.",
      },
      {
        id: 8,
        text: "Запрещается распространять информацию о багах/дюпах/недоработках игры. ВНИМАНИЕ! При обнаружении Вы обязаны сообщить администратору или модератору.",
        punishment:
          "Удаление сообщений/тем и повышение уровня предупреждений на 50 баллов.",
      },
      {
        id: 9,
        text: "Запрещается в жалобах на игрока выкладывать обрезанные/местами замазанные скриншоты.",
        punishment: "Повышение уровня предупреждений на 20 баллов.",
      },
      {
        id: 10,
        text: "Запрещается продавать/пытаться продать свой аккаунт/дом/вещи и т.д. за реальную валюту или иные ценности.",
        punishment: "Удаление сообщений/тем и блокировка форумного аккаунта.",
      },
      {
        id: 11,
        text: "Запрещается подстрекательство/призывы к нарушению правил сервера/форума.",
        punishment:
          "Удаление сообщений и повышение уровня предупреждений на 50 баллов.",
      },
      {
        id: 12,
        text: "Запрещается использовать в подписи: - крупные изображения; - явную или скрытую рекламу; - адреса web-сайтов (включая сокращатели ссылок). Ссылки на ресурсы совместные с lemoncraft разрешаются; - любые контактные данные: телефонные номера, e-mail, ICQ и т. д.",
        punishment:
          "Удаление подписи и повышение уровня предупреждений на 20 баллов.",
      },
      {
        id: 13,
        text: "Запрещается оскорблять сервер и администрацию.",
        punishment: "Удаление сообщений/тем и блокировка аккаунта.",
      },
      {
        id: 14,
        text: "Запрещается использование аватаров непристойного, оскорбительного содержания или по другим причинам неприемлемыми для размещения на форуме.",
        punishment:
          "Удаление сообщений/тем и блокировка возможности отправлять сообщения на форуме на срок, необходимый для проведения операции удаления запрещенного аватара.",
      },
      {
        id: 15,
        text: "Запрещается накручивать репутацию и другую статистику пользователя любым способом, включая создание пользователей-клонов, а также склонять (агитировать) других пользователей к ее изменению.",
        punishment:
          "Снятие репутации и повышение уровня предупреждений на 80 баллов.",
      },
      {
        id: 16,
        text: "Все пользователи проекта обязаны соблюдать все выше перечисленные правила.",
      },
    ],
  ];

  const rulesCategorys = [
    { title: "Основные", number: 1 },
    { title: "Правила сервера", number: 2 },
    { title: "Обязанности модераторов", number: 3 },
    { title: "Правила форума и сайта", number: 4 },
  ];

  return (
    <main className={style.rules}>
      <div className="container">
        <Header user={user} userIsLoaded={userIsLoaded} />

        <div className={style.rules__wrapper}>
          <div>
            <section className={style.rules__content}>
              <h1>Общие правила</h1>

              <ul className={style.rules__category__list}>
                {rulesCategorys.map(({ title, number }, index) => (
                  <li
                    key={index}
                    onClick={() => setCurrentRulesCategory(index)}
                    style={
                      currentRulesCategory === index
                        ? {
                            background:
                              "linear-gradient(180deg, #33e1ff 0%, #28ffef 100%)",
                            color: "white",
                          }
                        : { opacity: 1 }
                    }
                  >
                    <p>{number}.</p> <p>{title}</p>
                  </li>
                ))}
              </ul>

              <ul className={style.rules__list}>
                <h2>
                  {
                    rulesCategorys[
                      currentRulesCategory > rulesList.length - 1
                        ? 0
                        : currentRulesCategory
                    ].title
                  }
                </h2>

                {rulesList[
                  currentRulesCategory > rulesList.length - 1
                    ? 0
                    : currentRulesCategory
                ].map(({ text, id, punishment, rules, section }) => (
                  <li>
                    {text && (
                      <>
                        <p>
                          {id} {text}
                        </p>

                        {punishment && <p>{punishment}</p>}
                      </>
                    )}

                    {rules && punishment && (
                      <>
                        <h2>{section}</h2>

                        <div className={style.rules__item__list}>
                          {rules.map((item) => (
                            <p>{item}</p>
                          ))}
                        </div>

                        <p className={style.rules__punishment}>{punishment}</p>
                      </>
                    )}
                  </li>
                ))}
              </ul>
            </section>
          </div>

          <section className={style.rules__right__menu}>
            <RightMenu user={user} userIsLoaded={userIsLoaded} />
          </section>
        </div>

        <div className="footer">
          <div className={style.rules__footer}>
            <Footer />
          </div>
        </div>
      </div>
    </main>
  );
};

export default Rules;
